tutorials/chtMultiRegion4PCMFoam/photovoltaicPanel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    bottom
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    left
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    right
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}


// ************************************************************************* //
