tutorials/chtMultiRegion4PCMFoam/photovoltaicPanel/system/PV/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 296;

        boundaryField
        {
            top
            {
                type		photovoltaic4PCMFoam;
                Kappa		Kappa;
                absorptivity	1.0;
                emissivity	0.85;
                etaRef		0.13;
                betaRef		0.0041;
                TRef		298;
                qo		(800);
                ho		(6.0);
                To		(296.0);
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            PV_to_PCM
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName PCM;
                neighbourPatchName PCM_to_PV;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }

            PV_to_fin1
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin1;
                neighbourPatchName fin1_to_PV;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }

            PV_to_fin2
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin2;
                neighbourPatchName fin2_to_PV;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }

            PV_to_fin3
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin3;
                neighbourPatchName fin3_to_PV;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }
        }
    }

    rho
    {
        internalField   uniform 2258;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            PV_to_PCM
            {
                type            zeroGradient;
            }

            PV_to_fin1
            {
                type            zeroGradient;
            }

            PV_to_fin2
            {
                type            zeroGradient;
            }

            PV_to_fin3
            {
                type            zeroGradient;
            }
        }
    }

    Kappa
    {
        internalField   uniform 12.2;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            PV_to_PCM
            {
                type            zeroGradient;
            }

            PV_to_fin1
            {
                type            zeroGradient;
            }

            PV_to_fin2
            {
                type            zeroGradient;
            }

            PV_to_fin3
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 731;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            PV_to_PCM
            {
                type            zeroGradient;
            }

            PV_to_fin1
            {
                type            zeroGradient;
            }

            PV_to_fin2
            {
                type            zeroGradient;
            }

            PV_to_fin3
            {
                type            zeroGradient;
            }
        }
    }
}


// ************************************************************************* //
